[
  {
    "version": "1.4.2",
    "date": 1756994963319,
    "changelog": "## Changes\n - Changed some cache stuff, hopefully SMEditor works while offline again\n - Added the ability to override parity with left/right heel/toe\n   - The dancing bot will still prefer to hit brackets while facing foward, so you will have to mark backwards brackets manually\n - Enable parity highlights by default\n - Allow opening more than one instance of SMEditor when using the app (File > New Window)\n - Added more default timing events when creating a new chart\n - Added a search bar to the menubar (under Help tab)\n - Added commit info in the About window\n - Tech error indicators hide when in play mode\n - Centered the no files text in the custom file picker\n## Fixes\n - Fixed BANNER not being saved correctly when saving as .sm\n - Fixed an issue with measures when no time signature is placed at beat 0 and a non 4/4 signature is used\n - Fixed not being able to remove some notes when force every snap is on\n - Fixed pastel noteskin not showing 192nd quants\n"
  },
  {
    "version": "1.4.1",
    "date": 1752867826965,
    "changelog": "## Changes\n- You can now change the color of the feet for parity checking in user preferences.\n- Changed how the menubar behaves (you have to click on the tabs to open them, but you don't have to be precise while navigating dropdowns anymore)\n- The parity checker now checks for an ambiguous first step.\n ## Fixes\n - The canvas no longer reacts to mouse events when a window is over it\n- Fixed a bug in how twisted brackets are calculated \n - Fixed the chart info scroll highlights being very black"
  },
  {
    "version": "1.4.0",
    "date": 1752867826965,
    "changelog": "## Parity Checking!\n- You can know enable parity checking (default keybind `E` or through *View > Parity > Enable Parity Checking*)!\n- Includes features such as:\n  - Automatic flow error checking (unmarked doublestep, ambiguous step, etc...)\n  - Player direction timeline\n  - Candle highlighting\n  - Dancing bot\n  - ...and more! (check out the [wiki](/smeditor/guide/parity) for more details)\n- Calculation happens in the background for little to no lag (hopefully)\n- Any parity data is saved to a file called `data.sme`. This file can be safely deleted for release.\n- Currently only dance-single and dance-double are supported.\n- This is still in a beta state, so please report bugs!\n \n## Changes\n- SMEditor will now ask to load the SSC file if it is available in the same folder. You can change this behavior in *Preferences > General > Auto-load SSC files*\n- You can now have the timelines on the right of the screen follow the current song position (*Preferences > Timelines > Follow current position*)\n- WARPS and FAKES can now only have values to the nearest 192nd to match in game behavior (entering a different value will round it internally).\n- Reorganized a few options in the preferences window.\n- Changes a few elements to have different mouse cursors on hover\n- Reversed Yes/No order on no audio file confirmation window to match other windows\n\n## Fixes\n- Fixed another memory leak :(\n- Fix speeds with equal values and different delays being removed\n- The current note selection correctly appears on the timeline\n- Fixed waveform not updating when loading a new audio file through the chart/song properties\n- Fixed color inputs not working in the preferences window\n"
  },
  {
    "version": "1.3.0",
    "date": 1749416538350,
    "changelog": "## Changes\n- **Made UI scale with window height + font size** (this should hopefully help larger/smaller displays)\n  - If the UI is still too large/small, you can adjust the size in the Preferences window (UI scale).\n  - please report any bugs! this is a pretty big change\n- Exporting videos!\n  - You can now export a video of your chart under File > Export video...\n  - This feature does not work on Firefox, unfortunately\n- Added Force Snap Notes option\n  - This will force any notes placed to be on a snap even if the cursor is not currently on a snap.\n- Reduced mine volume\n## Fixes\n- Fixed the path being incorrect when selecting a file in the song/chart properties window when using the desktop app on Windows\n- Made hold flashes display in edit mode\n- Fixes some issues with embedding SMEditor + embed flags\n- Fixed Max NPS displaying as -1.7e308 (for real this time)"
  },
  {
    "version": "1.2.1",
    "date": 1747697188266,
    "changelog": "## Fixes\n- **Fixed key detection for non-QWERTY keyboards**\n- Fixed selection box not updating when chart is scrolled/moved using arrow keys\n- Fixed up/down and next/previous measure not inverting when \"Invert scroll while in reverse\" is on\n- Fixed chart beat not updating when time is updated and the song is not playing \n\n## Internal Changes\n- Revamped how chart stats are calculated (slight performance increase!)\n- Renamed some timing data functions (docs updated soon i promise)\n- Updated some packages\n"
  },
  {
    "version": "1.2.0",
    "date": 1742002339395,
    "changelog": "## Changes\n - **Pump fixes**\n   - **Reworked hold logic in pump game modes**\n   - Added pump timing windows\n - **New Keybinds**\n   - Ctrl-Up/Down: Previous/next stream\n     - This replaces the previous keybind of changing scroll speed (rebound to Shift-Up/Down)\n   - Shift-F5/F6: Previous/next song in pack\n - Increase timing event value precision to 6 decimals (you can enter more than 3 decimals now)\n - Make timing events snap to a minimum of 192nds to match game behavior\n    - Previously you could place them at 1000ths, but this will not load in game correctly\n - Changing timing windows now save for all similar modes (dance, pump)\n - Sync Window offset/bpm results can be clicked to apply at the current beat\n - Add options to convert a selection to a timing event (\"Selection -> Timing\")\n - Added an about window to check your current version (\"Help -> About\")\n## Fixes \n - Fix receptor dragging while in reverse\n - Fix switching ease unit for SPEEDS in Edit Timing Data window not working\n - Fixed \"PageUp\"/\"PageDown\" displaying as \"Home\"/\"End\" on non-Mac systems in keybinds\n\n"
  },
  {
    "version": "1.1.1",
    "date": 1734389306256,
    "changelog": "## Fixes\n- Fixed files not saving on Safari (thanks safari)\n- Fixed timing data parsing when events appear out of order in the sm file\n- Fixed Song Properties file pickers not working correctly on desktop app"
  },
  {
    "version": "1.1.0",
    "date": 1733884335684,
    "changelog": "## Changes\n - **Reworked split timing (chart/song timing)**\n   - Timing columns have a C/S box when in **Edit Timing** mode. You can toggle between them by opening the popup or clicking the **Manage Split Timing** button in the status widget\n   - Wiki will be updated soon to reflect these changes\n - **Autosaving!**\n   - Every once in a while, your file will be saved (default 120 seconds, changable in options)\n   - Stored in SSC format under `.smebak`\n - **SPEEDS and SCROLLS are now allowed in SM files** for recent NotITG changes (hopefully there isn't an SM parser that breaks because of this)\n - Added an option to open these changelogs under Help in the menubar\n - Added keybinds to toggle Edit/Add Timing (`T` and `Alt-T` by default)\n - Changed Skip to Start button in status widget to skip to start of song, not beat 0 to match keybind\n - Changed the file picker so that Chrome doesn't complain about \"containing system files\"\n - Changed EQ and Detect Sync canvases to match theme colors\n - Made textboxes in chart properties undoable\n - Allow keybinds to use numbers (this will take precedence over placing notes, but you can bind gameplay keybinds)\n## Fixes \n - **File saving issues**\n   - Fixed files not being saved properly when special characters are used\n   - Fixed chart timing data not being saved\n   - Fixed chart timing data being parsed incorrectly (but somehow still being saved)\n - **Multiple assist tick / metronome fixes**\n   - Fixed them being loud when a hold is being placed during playback\n   - Fixed metronome spam on WARPS\n - Fixed holds not being truncated sometimes due to triplets\n - Fixed \"Invert scroll in reverse\" when \"Snap every scroll\" is on\n - Fixed many UI elements not being visible when in light themes\n - Fix song playback starting at the wrong time with songs with positive offset + rate mod\n\n"
  },
  {
    "version": "1.0.0",
    "date": 1731940757839,
    "changelog": "## Changes\n- Changelog System\n    - *we'll just start the versions from 1.0.0*\n - Update Popups\n    - You will be notified when a new version is available (just refresh the page) \n ## Fixes \n - Fixed two memory leaks when loading a new chart"
  }
]